{
  "backend/main.mo": "Actor manages presale state, tracks contributions and allocations, and exposes queries and updates with validation and cap enforcement.",
  "feature_evidence.json": "Feature evidence linking presale remaining-ICP formatting requirement to the PresaleProgress component with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend files, including presale UI components, hooks, utilities, and styling.",
  "frontend/index.css": "Defines global Tailwind-based styles, color variables, and dark mode overrides with neon theme.",
  "frontend/index.html": "Base HTML file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main app layout combining presale sections, post-presale listings, animated background effects, and music controller.",
  "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx": "Renders mute and volume controls in a popover when background music is playing.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright and caffeine.ai attribution with dynamic host identifier.",
  "frontend/src/components/presale/ContributorsList.tsx": "Aggregates and displays contributor data in a styled table with timestamps and loading states.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Displays a 24‑hour countdown timer using values from useCountdown24h.",
  "frontend/src/components/presale/DepositAddress.tsx": "Shows the presale deposit address with clipboard copy functionality and confirmation message.",
  "frontend/src/components/presale/HeroSection.tsx": "Displays the presale hero section with an image, animated title, tagline, and three feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "Explains how to contribute to the presale with numbered steps and key presale details using constants.",
  "frontend/src/components/presale/PostPresaleListingsSection.tsx": "Shows post‑presale listing info with loading, active‑presale, and finished‑presale states using presale status and constants.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Displays presale progress, including percent, stats, remaining ICP, and an ended badge based on presale status.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps countdown, presale parameters, progress bar, and deposit address into the main presale status section.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Presents tokenomics info and a FAQ section using preset constants like max supply.",
  "frontend/src/constants/listingsAfterPresale.ts": "Defines the ListingItem type and an array of planned post‑presale listings.",
  "frontend/src/constants/presale.ts": "Exports presale constants including deposit address, cap, max supply, and polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "React hook managing background music playback, preferences, and autoplay handling with a persistent audio element.",
  "frontend/src/hooks/useContributors.ts": "Fetches contributor data via actor.getAllContributors with polling using React Query.",
  "frontend/src/hooks/useCountdown24h.ts": "Provides a live countdown from 24 hours, updating hours, minutes, and seconds every second.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identities, and AuthClient lifecycle.",
  "frontend/src/hooks/usePresaleStatus.ts": "Fetches presale status via actor.getPresaleStatus with periodic polling.",
  "frontend/src/index.css": "Tailwind base styles plus custom neon color variables and various animation utility classes.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/backgroundMusicStorage.ts": "Handles saving and loading music preferences and opt-in state from localStorage.",
  "frontend/src/utils/contributors.ts": "Aggregates raw contribution records by address, summing amounts and sorting by latest timestamp.",
  "frontend/src/utils/format.ts": "Formats numbers with German-style dot thousand separators for ICP values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and theme settings including neon color variables.",
  "project_state.json": "Defines the current project state for the IcpMemeDoge presale site, including goals, architectural notes, known issues, and implemented features. Acts as a planning and tracking record for build, integration, and UI requirements."
}