{
  "backend/main.mo": "Actor canister managing presale state, contributions, allocations, and presale status queries.",
  "feature_evidence.json": "Feature evidence report mapping implemented frontend files to presale-related feature requirements.",
  "frontend-file-summaries.txt": "Text file listing short descriptions of all major frontend components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based neon theme styles and color variables for light and dark modes.",
  "frontend/index.html": "Base HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React root component assembling all presale sections with animated neon background.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright info and a caffeine.ai attribution link.",
  "frontend/src/components/presale/ContributorsList.tsx": "Displays aggregated contributor data in a neon-styled table with loading and empty states.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Shows a 24‑hour countdown timer using the useCountdown24h hook.",
  "frontend/src/components/presale/DepositAddress.tsx": "Displays the presale deposit address with copy‑to‑clipboard functionality.",
  "frontend/src/components/presale/HeroSection.tsx": "Hero section with hero image, animated neon headline, tagline, and feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "UI section explaining steps for contributing ICP to the presale and showing key presale details.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Displays presale progress, ICP totals, and end status using data from usePresaleStatus.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps countdown, presale parameters, progress bar, and deposit address into a single status section.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Shows tokenomics info and a FAQ section using MAX_SUPPLY and static presale details.",
  "frontend/src/constants/presale.ts": "Defines presale constants including deposit address, cap, max supply, and polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useContributors.ts": "Fetches all presale contributors periodically using the backend actor.",
  "frontend/src/hooks/useCountdown24h.ts": "Provides a 24‑hour countdown timer with hours, minutes, and seconds remaining.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, and stored identities through a React context.",
  "frontend/src/hooks/usePresaleStatus.ts": "Periodically fetches presale status data from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme CSS variables, neon color utilities, and multiple custom animation utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, importing global styles.",
  "frontend/src/utils/contributors.ts": "Aggregates contribution records by address, summing amounts and sorting by latest timestamp.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors from CSS variables, animations, and plugin setup.",
  "project_state.json": "Stores project metadata, feature requirements, architectural notes, and the overall presale site specification."
}