{
  "backend/main.mo": "Motoko canister managing presale state, tracking ICP contributions, allocations, timestamps, and exposing query/update methods.",
  "feature_evidence.json": "Feature evidence record describing formatting update for ICP remaining display and listing related frontend files and metadata.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions summarizing each component’s purpose.",
  "frontend/index.css": "Tailwind base styles with custom CSS variables for light/dark themes and global background/foreground settings.",
  "frontend/index.html": "HTML entry page containing root mount node and module script loading the React app.",
  "frontend/src/App.tsx": "Main React layout combining presale sections with animated background effects.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright text and caffeine.ai attribution with dynamic hostname tracking.",
  "frontend/src/components/presale/ContributorsList.tsx": "Displays aggregated contributor data in a table with loading states and relative timestamps.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Renders a styled countdown timer using values from the 24-hour countdown hook.",
  "frontend/src/components/presale/DepositAddress.tsx": "Shows the deposit address with a copy-to-clipboard button and success feedback.",
  "frontend/src/components/presale/HeroSection.tsx": "Hero section with animated meme image, gradient headline, tagline, and feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "UI section explaining the three-step presale contribution process and listing key presale parameters.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Displays presale progress with a progress bar, ICP stats, and an ended badge using live presale status data.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps countdown, presale parameters, progress display, and deposit address into a full presale status section.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Shows tokenomics info and a FAQ section including supply, blockchain, and presale details.",
  "frontend/src/constants/presale.ts": "Defines presale constants including deposit address, cap, max supply, and polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useContributors.ts": "Fetches and polls the contributor list from the backend actor using react-query.",
  "frontend/src/hooks/useCountdown24h.ts": "Provides a 24‑hour countdown timer with hours, minutes, and seconds updated every second.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, and authentication state.",
  "frontend/src/hooks/usePresaleStatus.ts": "Fetches and polls presale status data from the backend actor using react-query.",
  "frontend/src/index.css": "Sets Tailwind layers, defines theme CSS variables including neon colors, and adds custom animations and utility classes for neon effects and motion.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider, then renders App with global styles.",
  "frontend/src/utils/contributors.ts": "Aggregates raw Contribution entries by address, summing ICP amounts and sorting by most recent timestamp.",
  "frontend/src/utils/format.ts": "Formats numbers using German thousands separators with no decimals for ICP display.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, including OKLCH-based color tokens, neon colors, container settings, and custom keyframes/plugins.",
  "project_state.json": "Describes the project’s presale site goals, architecture, features, and known issues for planning and tracking."
}