{
  "backend/main.mo": "Manages presale state, tracks ICP contributions and allocations, enforces cap rules, and exposes query methods for status and contributor data.",
  "feature_evidence.json": "Feature evidence report documenting a music replacement change and the files, components, and tests involved.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining color variables and theming for light and dark modes with global resets.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Composes all presale sections and includes animated background effects and the background music controller.",
  "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx": "Floating controller that manages play, mute, volume, and error display for background music.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright info and a caffeine.ai attribution link with tracking.",
  "frontend/src/components/presale/ContributorsList.tsx": "Displays aggregated contributors in a styled table with loading skeleton and timestamps.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Neon-styled countdown timer showing hours, minutes, and seconds from a 24‑hour hook.",
  "frontend/src/components/presale/DepositAddress.tsx": "Shows the presale deposit address with clipboard copy functionality and feedback.",
  "frontend/src/components/presale/HeroSection.tsx": "Displays the main hero area with an image, animated title, tagline, and three feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "Explains presale contribution steps and shows key details using constants like the deposit address and cap.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Fetches presale status and shows progress, ICP totals, remaining cap, and an end-of-presale badge.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps countdown, presale parameters, progress display, and deposit address into a single status section.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Presents tokenomics data and a FAQ section using constants such as max supply.",
  "frontend/src/constants/presale.ts": "Defines presale constants including deposit address, hard cap, max supply, and polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Manages background music playback, preferences, autoplay handling, and user interaction unblock logic.",
  "frontend/src/hooks/useContributors.ts": "Periodically fetches all contributors from the backend actor using react-query polling.",
  "frontend/src/hooks/useCountdown24h.ts": "Provides a 24-hour countdown timer with hours, minutes, and seconds updated every second.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context/provider and hook, handling AuthClient creation, login state, and identity persistence.",
  "frontend/src/hooks/usePresaleStatus.ts": "Provides a React Query hook to fetch and poll the presale status from the actor API.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom neon-themed styles, animations, and color utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/backgroundMusicStorage.ts": "Handles loading and saving background music preferences and opt‑in flags via localStorage.",
  "frontend/src/utils/contributors.ts": "Aggregates contribution data by address, summing amounts and sorting by latest timestamp.",
  "frontend/src/utils/format.ts": "Formats numbers using German-style thousands separators for ICP values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin usage for the project.",
  "project_state.json": "Stores overall project state, requirements, known issues, and architectural notes for the presale website."
}