{
  "backend/main.mo": "Manages presale state, tracks contributions and allocations, enforces presale cap, and exposes query and update methods.",
  "feature_evidence.json": "Feature evidence report mapping audio playback features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files including components, hooks, utilities, and styling.",
  "frontend/index.css": "Tailwind base/theme definitions with custom color variables and dark mode overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component assembling all presale sections and rendering the background music controller.",
  "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx": "Floating UI for controlling background music with play, mute, volume slider, and error display.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright and a referral link with dynamic UTM content.",
  "frontend/src/components/presale/ContributorsList.tsx": "Fetches, aggregates, and displays contributors in a styled table with loading and empty states.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Shows a 24‑hour countdown using values from useCountdown24h.",
  "frontend/src/components/presale/DepositAddress.tsx": "Displays the presale deposit address with copy-to-clipboard feedback.",
  "frontend/src/components/presale/HeroSection.tsx": "Displays the presale hero section with an animated image, headline, tagline, and feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "Explains how to join the presale with step-by-step instructions and key presale info.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Shows live presale progress including percentage, ICP stats, and an ended badge using presale status data.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps countdown, presale parameters, progress, and deposit address into a single status section.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Presents tokenomics details and a FAQ section for the IcpMemeDoge presale.",
  "frontend/src/constants/presale.ts": "Defines presale constants like deposit address, cap, max supply, and polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Manages background music playback with volume, mute state, autoplay handling, and user interaction unblocking.",
  "frontend/src/hooks/useContributors.ts": "Fetches and polls the list of presale contributors using the backend actor.",
  "frontend/src/hooks/useCountdown24h.ts": "Provides a 24-hour countdown timer with hours, minutes, and seconds remaining.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login flow, identity loading, and status tracking.",
  "frontend/src/hooks/usePresaleStatus.ts": "Fetches presale status from the backend actor using React Query with polling and conditional enabling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom neon-themed utilities, animations, and color variables for the app’s visual theme.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/backgroundMusicStorage.ts": "Handles loading, saving, and validating user preferences for background music and opt‑in state via localStorage.",
  "frontend/src/utils/contributors.ts": "Aggregates contribution records by address, computing totals, counts, and latest timestamps.",
  "frontend/src/utils/format.ts": "Formats ICP numbers using German locale thousands separators with no decimal places.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, animations, and plugins to support the neon aesthetic.",
  "project_state.json": "Metadata describing project goals, architecture notes, issues, and implemented features for the presale website."
}