{
  "backend/main.mo": "Motoko actor managing presale state, tracking contributions and allocations, enforcing cap and status, and exposing query endpoints.",
  "feature_evidence.json": "Feature evidence report listing two animation and accessibility-related frontend features with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend components, hooks, utilities, and styling configuration.",
  "frontend/index.css": "Base Tailwind global styles defining color variables, dark mode values, and shared element styling.",
  "frontend/index.html": "Root HTML document mounting the React app and loading the main client script.",
  "frontend/src/App.tsx": "Main React component assembling hero, status, contributor, and footer sections with animated background effects.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright info and a caffeine.ai attribution link with tracking.",
  "frontend/src/components/presale/ContributorsList.tsx": "Displays aggregated contributor data in a table with loading states and relative timestamps.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Renders a neon-styled 24‑hour countdown timer using a custom hook.",
  "frontend/src/components/presale/DepositAddress.tsx": "Shows the presale deposit address and allows copying it with visual confirmation.",
  "frontend/src/components/presale/HeroSection.tsx": "Hero section with floating animated meme-dog image, animated headline, tagline, and feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "UI section explaining three-step presale contribution instructions and listing key presale details using constants.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Displays presale progress bar, ICP stats, and an end badge based on status data fetched via usePresaleStatus.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps countdown, presale parameters, progress, and deposit address into one status section using several subcomponents.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Shows tokenomics details using constants and includes a FAQ section describing the project and presale process.",
  "frontend/src/constants/presale.ts": "Defines presale constants including deposit address, ICP cap, max supply, and polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useContributors.ts": "Fetches contributor list via actor.getAllContributors with periodic polling tied to presale settings.",
  "frontend/src/hooks/useCountdown24h.ts": "Implements a 24‑hour countdown timer returning hours, minutes, and seconds remaining.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, and status management using AuthClient.",
  "frontend/src/hooks/usePresaleStatus.ts": "Polls backend presale status via actor.getPresaleStatus at a fixed interval using react‑query.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, and multiple neon/animated utility classes for styling the site.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, importing global styles.",
  "frontend/src/utils/contributors.ts": "Aggregates raw contribution entries by address, summing amounts, counting entries, and sorting by latest timestamp.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including custom OKLCH color variables, neon colors, container settings, and animations.",
  "project_state.json": "Describes the project's current state, requirements, features, and architectural notes for the ICP-based presale website."
}