{
  "backend/main.mo": "Implements presale logic including contribution recording, allocation tracking, status queries, and enforcing a hard ICP cap of 515B e8s.",
  "feature_evidence.json": "Describes feature evidence linking a UI requirement about showing remaining ICP to the PresaleProgress.tsx file.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend files used in the presale UI.",
  "frontend/index.css": "Defines global Tailwind styles and CSS variables for neon-themed light/dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Composes all presale sections with animated neon background effects.",
  "frontend/src/components/Footer.tsx": "Renders site footer with attribution and dynamic tracking link.",
  "frontend/src/components/presale/ContributorsList.tsx": "Displays aggregated contributor data in a table with loading and empty states.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Shows a 24-hour countdown with neon-styled time blocks.",
  "frontend/src/components/presale/DepositAddress.tsx": "Shows the deposit address with copy-to-clipboard interaction and confirmation.",
  "frontend/src/components/presale/HeroSection.tsx": "Hero banner with large animated meme-doge image, headline, tagline, and feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "Displays a three‑step guide for contributing to the presale along with key presale parameters and important notes.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Shows presale progress using data from usePresaleStatus, including percent complete, ICP received/remaining, and an end badge.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps the full presale status UI including countdown, parameters, progress bar, and deposit address.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Provides tokenomics details and a FAQ section using constants like max supply and presale cap.",
  "frontend/src/constants/presale.ts": "Defines core presale constants such as deposit address, ICP cap, token max supply, and polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useContributors.ts": "Fetches and polls the list of contributors from the backend actor using react‑query.",
  "frontend/src/hooks/useCountdown24h.ts": "Implements a 24‑hour countdown timer that updates every second.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, logout, and status via React context.",
  "frontend/src/hooks/usePresaleStatus.ts": "Fetches and polls presale status data from the backend actor using react‑query.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, and custom neon-themed utility classes with multiple animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/contributors.ts": "Aggregates raw Contribution records by address, summing amounts and sorting by latest timestamp.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended color variables, neon theme support, container settings, and custom animations.",
  "project_state.json": "Stores the project’s requirements, current state, architectural notes, known issues, and feature definitions."
}