{
  "backend/main.mo": "Motoko actor managing presale state, recording contributions, allocations, and enforcing cap with query endpoints for status and contributor data.",
  "feature_evidence.json": "Feature evidence report listing background‑music related feature requests, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short functional summaries for presale UI, hooks, utils, and background‑music system.",
  "frontend/index.css": "Tailwind base/style layer defining CSS variables for light/dark themes and applying global background and text styling.",
  "frontend/index.html": "Base HTML template mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app composing presale sections, animated background blobs, and the global background‑music controller.",
  "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx": "Floating UI component providing play, loading feedback, error messages, mute, and volume controls for background music.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright and a caffeine.ai attribution link with tracking.",
  "frontend/src/components/presale/ContributorsList.tsx": "Shows aggregated contributor data in a styled table with loading states and relative timestamps.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Displays a 24‑hour countdown using neon‑styled boxes for hours, minutes, and seconds.",
  "frontend/src/components/presale/DepositAddress.tsx": "Displays the presale deposit address with a copy-to-clipboard button and feedback state.",
  "frontend/src/components/presale/HeroSection.tsx": "Renders the hero banner with animated visuals, headline, tagline, and feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "Explains the steps to contribute to the presale and lists key participation details.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Shows presale progress using a progress bar and stats, with status-driven UI updates.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Combines countdown, presale parameters, progress bar, and deposit address into one section.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Displays tokenomics details and a FAQ section about the project and presale.",
  "frontend/src/constants/presale.ts": "Defines presale constants including deposit address, cap, max supply, and poll interval.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of authenticated or anonymous backend actors with identity-based updates.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Handles background music playback, user preferences, autoplay blocking, and audio lifecycle.",
  "frontend/src/hooks/useContributors.ts": "Fetches the list of presale contributors using the backend actor with periodic polling.",
  "frontend/src/hooks/useCountdown24h.ts": "Provides a hook that counts down 24 hours from first render and returns remaining hours, minutes, and seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React provider and hook for managing authentication state, login, logout, and identity loading via Dfinity AuthClient.",
  "frontend/src/hooks/usePresaleStatus.ts": "Queries the backend actor for presale status with polling using React Query.",
  "frontend/src/index.css": "Defines Tailwind base styles plus custom neon-themed CSS variables and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/backgroundMusicStorage.ts": "Manages saving and loading music preferences and opt‑in state from localStorage.",
  "frontend/src/utils/contributors.ts": "Aggregates contribution records by address, summing amounts and tracking latest timestamps.",
  "frontend/src/utils/format.ts": "Formats numbers using German-style dot thousands separators.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including custom neon variables.",
  "project_state.json": "Describes project state, requirements, architecture notes, and known issues for the presale website."
}