{
  "backend/main.mo": "Implements presale logic including contribution tracking, allocation updates, presale cap enforcement, and query endpoints for status and contributor data.",
  "feature_evidence.json": "Defines feature evidence entries mapping new UI features to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all major frontend source files describing their roles in the presale app UI.",
  "frontend/index.css": "Sets Tailwind base layers and defines light/dark CSS variables for the neon color system used across the UI.",
  "frontend/index.html": "Basic HTML wrapper that mounts the React application and loads the main TypeScript entry file.",
  "frontend/src/App.tsx": "Main React composition file that arranges all presale sections plus the new listings section and background music controller.",
  "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx": "UI controller for background music that shows mute and volume controls only when audio is playing.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with copyright text and a caffeine.ai attribution link including UTM parameters.",
  "frontend/src/components/presale/ContributorsList.tsx": "Fetches and aggregates contributor data and displays it in a neon-styled table with timestamps.",
  "frontend/src/components/presale/CountdownTimer.tsx": "Displays a neon-styled 24‑hour countdown using values from the useCountdown24h hook.",
  "frontend/src/components/presale/DepositAddress.tsx": "Displays the presale deposit address with a button to copy it and visual feedback when copied.",
  "frontend/src/components/presale/HeroSection.tsx": "Renders the main hero section with an image, headline, tagline, and three feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "Explains how to participate in the presale with three steps and a brief info box using presale constants.",
  "frontend/src/components/presale/PostPresaleListingsSection.tsx": "Shows post‑presale listings or loading/coming‑soon states based on presale status, using dynamic listing data.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Displays presale progress with a bar, ICP received/remaining stats, and a completion badge when ended.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps countdown, presale parameters, progress, and deposit address into a full presale status section.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "Presents tokenomics details and a FAQ section using constants like max supply and presale cap.",
  "frontend/src/constants/listingsAfterPresale.ts": "Defines the ListingItem interface and a list of planned post‑presale listings with titles, descriptions, and statuses.",
  "frontend/src/constants/presale.ts": "Exports presale constants including deposit address, cap, max supply, and polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Provides a hook to load, control, and persist background music playback with volume, mute, and autoplay‑unblock handling.",
  "frontend/src/hooks/useContributors.ts": "Fetches contributor data from the actor using react‑query with polling.",
  "frontend/src/hooks/useCountdown24h.ts": "Implements a 24‑hour countdown timer returning hours, minutes, and seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and state tracking.",
  "frontend/src/hooks/usePresaleStatus.ts": "Queries presale status from the actor with periodic polling.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and custom neon/animation utilities for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/backgroundMusicStorage.ts": "Handles loading and saving music preferences and opt‑in flags in localStorage.",
  "frontend/src/utils/contributors.ts": "Aggregates contributor entries by address, summing amounts and sorting by latest timestamp.",
  "frontend/src/utils/format.ts": "Formats numbers with German‑style dot thousand separators.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugin integrations.",
  "project_state.json": "Holds the project’s current state, including high‑level goals for an ICP‑based presale site, architectural notes for ledger integration and UI behavior, known issues, and a list of implemented features. Serves as the master specification guiding design, functionality, and pending fixes."
}