{
  "backend/main.mo": "Actor exposing health info placeholders and delegating HTTP outcall transformations.",
  "feature_evidence.json": "Feature evidence describing frontend polling hookup tasks with related files, components, and metadata.",
  "frontend-file-summaries.txt": "JSON-style list of frontend file descriptions used for documentation or build planning.",
  "frontend/index.css": "Tailwind base with extensive CSS variables defining light/dark color themes and layout globals.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app composing presale sections, animated background, and background music controller.",
  "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx": "Floating UI control for background music mute and volume using popover and slider.",
  "frontend/src/components/Footer.tsx": "Footer rendering copyright text and a caffeine.ai referral link.",
  "frontend/src/components/presale/ContributorsList.tsx": "Displays contributor data with sync indicators, stale data warnings, and IC Dashboard link.",
  "frontend/src/components/presale/CountdownTimer.tsx": "24‑hour countdown display using the countdown hook.",
  "frontend/src/components/presale/DepositAddress.tsx": "Shows presale ICP deposit address with copy button and IC Dashboard link.",
  "frontend/src/components/presale/HeroSection.tsx": "Displays the main presale hero section with an image, animated title, tagline, and three feature cards.",
  "frontend/src/components/presale/HowToContribute.tsx": "Explains the steps to contribute to the presale and shows key presale details using constants.",
  "frontend/src/components/presale/LatestTransactionsPanel.tsx": "Shows the latest contributions with auto‑refresh indicators, sync status warnings, and fallback states.",
  "frontend/src/components/presale/PostPresaleListingsSection.tsx": "Displays listing details after presale, with loading and active‑presale fallback states.",
  "frontend/src/components/presale/PresaleProgress.tsx": "Renders presale progress, warnings for sync issues, and live polling indicators using presale status.",
  "frontend/src/components/presale/PresaleStatusSection.tsx": "Wraps countdown, presale parameters, progress, deposit address, and transactions into a presale status section.",
  "frontend/src/components/presale/TokenomicsFaq.tsx": "React component rendering tokenomics details and FAQ, using MAX_SUPPLY and styled layout cards.",
  "frontend/src/constants/listingsAfterPresale.ts": "Defines a ListingItem type and a list of planned post‑presale listings with titles, descriptions, and statuses.",
  "frontend/src/constants/presale.ts": "Exports presale constants including deposit address, caps, supply, polling intervals, and dashboard URL.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Hook managing background audio playback, user preferences, autoplay blocking, and error handling.",
  "frontend/src/hooks/useContributors.ts": "Hook polling backend for contributor data and sync health, currently returning placeholder contributions.",
  "frontend/src/hooks/useCountdown24h.ts": "Provides a 24‑hour countdown timer with hours, minutes, and seconds remaining.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook wrapping AuthClient to manage login, identity state, and status flags.",
  "frontend/src/hooks/usePresaleStatus.ts": "Hook polling presale stats and health, currently returning placeholder presale data with sync monitoring.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, and numerous custom neon and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider.",
  "frontend/src/utils/backgroundMusicStorage.ts": "Handles loading, saving, and validating background‑music preferences and opt‑in state in localStorage.",
  "frontend/src/utils/contributors.ts": "Aggregates contribution records by address and sorts them by most recent timestamp.",
  "frontend/src/utils/format.ts": "Formats numbers using German locale with fixed three‑decimal output.",
  "frontend/src/utils/utcTimestamp.ts": "Converts nanosecond timestamps into formatted UTC date strings.",
  "frontend/src/utils/withTimeout.ts": "Provides a Promise timeout wrapper and a custom TimeoutError class.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors from CSS variables, and plugin integrations.",
  "project_state.json": "Captures project status, requirements, architecture notes, and known issues for the presale website."
}