{
  "kind": "build_request",
  "title": "Remove the floating background-music Play button",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Remove the floating background-music Play button from the UI so that the site never renders a Play button when background music is not currently playing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Playbutton löschen"
        ]
      },
      "acceptanceCriteria": [
        "When music is not playing, no floating Play button is visible anywhere on the page.",
        "The previous 'starting' / loading indicator tied to pressing Play is not shown (because Play is no longer available).",
        "The change is limited to UI behavior; it does not introduce any new user-facing text (all remaining user-facing text stays in English)."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Keep the existing background-music mute and volume controls available only when background music is already playing, without adding any new way to start playback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Playbutton löschen"
        ]
      },
      "acceptanceCriteria": [
        "If background music is playing (e.g., user previously opted in and autoplay succeeds), the mute and volume controls still render and work.",
        "If background music is not playing, the background-music controller renders nothing (no error toast UI, no buttons)."
      ]
    }
  ],
  "constraints": [
    "Do not change the existing audio asset URL/path used by the app; it must remain exactly \"/assets/audio/background-dance.mp3\".",
    "Do not modify any files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change the background music track or audio file contents.",
    "Do not add a replacement UI/setting to start music playback.",
    "No backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}