{
  "kind": "build_request",
  "title": "Ensure Play button reliably starts 90s dance background music",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Ensure that pressing the floating Play button starts playback of the bundled 90s dance background music track using the existing audio path \"/assets/audio/background-dance.mp3\", and that the UI correctly reflects the playing state immediately after a successful start (switching from Play to the mute/volume controls).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Wenn ich den Play button drücke soll dance musik aus den 90s starten"
        ]
      },
      "acceptanceCriteria": [
        "On a first-time visit (no prior opt-in), the site does not autoplay music and shows the Play button.",
        "Clicking the Play button starts audio playback of /assets/audio/background-dance.mp3 (looping) and the UI switches to the mute/volume controls.",
        "After a page reload (with opt-in stored), music either plays automatically or, if blocked by browser policy, starts upon the next user interaction per the existing unblock logic.",
        "The existing mute/unmute and volume persistence behavior continues to work as before."
      ]
    },
    {
      "id": "REQ-26",
      "text": "If playback cannot be started after the user presses the Play button (e.g., browser blocks playback or the audio asset fails to load), show a clear user-facing error message in English while keeping the page usable and leaving the Play button available for retry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Wenn ich den Play button drücke soll dance musik aus den 90s starten"
        ]
      },
      "acceptanceCriteria": [
        "When userInitiatedPlay() fails, the UI shows an English message indicating music could not be started and suggests trying again.",
        "The Play button remains visible/usable so the user can retry starting music.",
        "No console error causes React rendering to break (page remains usable)."
      ]
    }
  ],
  "constraints": [
    "Keep the background music asset path unchanged: /assets/audio/background-dance.mp3.",
    "Do not modify files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding additional music tracks, a playlist, or a track selector.",
    "Changing the overall presale page layout/sections unrelated to background music."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}