{
  "kind": "build_request",
  "title": "Refine background music loading and playback reliability",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Refine the background music initialization so that user-initiated playback starts more reliably and quickly after pressing the floating Play button, without changing the audio asset URL (must remain exactly \"/assets/audio/background-dance.mp3\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "If you want, I can refine how the audio gets loaded next.",
          "Refine please"
        ]
      },
      "acceptanceCriteria": [
        "Pressing the floating Play button results in an audible start (or a clear error) within a reasonable time, without requiring multiple clicks in common browsers.",
        "The audio file path used for playback remains exactly \"/assets/audio/background-dance.mp3\".",
        "No background music autoplay is introduced for first-time visitors who have not opted in."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Add an explicit “starting/loading” UI state for background music playback attempts that prevents duplicate play requests and provides clear English feedback during startup (e.g., disable the Play button while a start attempt is in flight, and surface a short loading indicator/text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Refine please"
        ]
      },
      "acceptanceCriteria": [
        "While a playback start attempt is in progress, the Play button cannot be spam-clicked to create overlapping play() calls.",
        "The UI clearly communicates the startup state in English (e.g., “Starting music…”), and returns to normal Play state if startup fails.",
        "If startup succeeds, the UI immediately switches from Play to the existing mute/volume controls as it does today."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Improve robustness of background music error handling and retry behavior for failed starts and failed loads, keeping all user-facing error text in English and leaving the page usable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "If you want, I can refine how the audio gets loaded next.",
          "Refine please"
        ]
      },
      "acceptanceCriteria": [
        "If playback fails to start or the audio fails to load, a clear English error is shown and the Play button remains available for retry.",
        "A retry after a failure can succeed without requiring a page reload (when the underlying issue is resolved, e.g., transient load failure).",
        "Existing mute/volume persistence behavior remains intact."
      ]
    }
  ],
  "constraints": [
    "Do not change the background music asset path; it must remain exactly \"/assets/audio/background-dance.mp3\".",
    "Do not edit any files under frontend/src/components/ui (Shadcn components are read-only in this environment).",
    "Keep background music opt-in behavior: do not autoplay on initial page load unless the visitor has previously opted in."
  ],
  "nonGoals": [
    "Changing or adding additional audio files/URLs beyond the existing \"/assets/audio/background-dance.mp3\" path.",
    "Backend changes (this refinement is frontend-only).",
    "Changing the overall site layout, presale flow, or non-music-related UI features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}