{
  "kind": "build_request",
  "title": "Adjust background music behavior to be user-initiated and less intrusive",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Change the background music behavior so it does not attempt to autoplay on initial page load unless the visitor has previously opted in; instead, show a persistent, unobtrusive “Play music” control that starts playback only after an explicit user action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Bitte anpassen"
        ]
      },
      "acceptanceCriteria": [
        "On a first-time visit (no stored preference), the site loads with background music not playing.",
        "A visible control is available to start playback via click/tap and via keyboard (Enter/Space).",
        "After the visitor explicitly starts playback once, the app remembers this choice (localStorage) and may attempt autoplay on subsequent visits (still subject to browser policies).",
        "No new user-facing text is introduced in German; any labels/messages are in English."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Keep the existing audio asset path unchanged and ensure the background music controls still support mute/unmute and volume persistence, with safe defaults that avoid unexpectedly loud playback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Bitte anpassen"
        ]
      },
      "acceptanceCriteria": [
        "The audio file path remains exactly '/assets/audio/background-dance.mp3'.",
        "Mute/unmute and volume controls continue to work and persist across reloads using the existing localStorage mechanism.",
        "Default volume remains conservative (at or below the current 30%) when no stored preference exists.",
        "If autoplay is blocked by the browser, the UI clearly offers a “Play music” action and the rest of the page remains fully usable."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (compose these components instead).",
    "Do not modify the background audio file path '/assets/audio/background-dance.mp3'.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Changing presale logic, ledger polling, progress tracking, or contributor listing behavior.",
    "Adding new audio tracks or fetching audio from external URLs.",
    "Implementing any third-party consent/analytics platform."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}