{
  "kind": "build_request",
  "title": "Animate the hero meme-dog image (movable dog)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Make the hero meme-dog image in the Hero section visibly movable by adding a subtle, continuous animation (e.g., floating/bobbing with slight rotation) while keeping the existing image file path and overall layout intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Der Hund im Bild soll beweglich sein"
        ]
      },
      "acceptanceCriteria": [
        "On the landing page, the hero image at /assets/generated/icp-meme-doge-hero.dim_1600x900.png animates continuously with subtle motion (not distracting).",
        "The hero image remains responsive (keeps its current sizing, rounded corners, and shadow styling) and does not overlap or shift other sections unexpectedly.",
        "The image src path remains exactly /assets/generated/icp-meme-doge-hero.dim_1600x900.png."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Respect accessibility preferences by disabling or significantly reducing the hero image motion when the user has enabled reduced motion (prefers-reduced-motion).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Der Hund im Bild soll beweglich sein"
        ]
      },
      "acceptanceCriteria": [
        "With prefers-reduced-motion enabled in the browser/OS, the hero image animation is removed or reduced to near-static behavior.",
        "No rapid flashing is introduced; motion remains smooth and slow."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Do not change the hero image asset filename or route; keep using /assets/generated/icp-meme-doge-hero.dim_1600x900.png.",
    "Keep the existing neon theme and avoid introducing rapid flashing or aggressive motion."
  ],
  "nonGoals": [
    "Do not replace or regenerate the hero image asset.",
    "Do not add new backend functionality for this change.",
    "Do not introduce new pages or sections; only adjust the hero image presentation/animation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}