{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make background music user-initiated with remembered opt-in and unobtrusive controls",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Prevent first-visit autoplay; provide a persistent Play music control and remember explicit opt-in for future visits.",
      "acceptanceCriteria": [
        "On a first-time visit (no stored preference), the site loads with background music not playing.",
        "A visible control is available to start playback via click/tap and via keyboard (Enter/Space).",
        "After the visitor explicitly starts playback once, the app remembers this choice (localStorage) and may attempt autoplay on subsequent visits (still subject to browser policies).",
        "No new user-facing text is introduced in German; any labels/messages are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Update background music initialization so autoplay is only attempted when a stored opt-in flag is present; add state/logic to record opt-in when the user explicitly starts playback; ensure user-gesture listeners are only used to recover playback when the user has opted in (or after explicit interaction)."
        },
        {
          "path": "frontend/src/utils/backgroundMusicStorage.ts",
          "operation": "modify",
          "description": "Add a small localStorage-backed opt-in persistence helper (separate key from existing mute/volume storage) to load/save whether the visitor has explicitly chosen to play music; keep existing preferences behavior intact."
        },
        {
          "path": "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx",
          "operation": "modify",
          "description": "Adjust UI logic to always render a persistent, unobtrusive “Play music” control whenever music is not playing (including first visit), not only when autoplay is blocked; keep keyboard-accessible interaction via the shadcn-ui Button component. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Preserve the existing audio asset path and keep mute/unmute and volume persistence with safe default volume and clear play action when autoplay is blocked.",
      "acceptanceCriteria": [
        "The audio file path remains exactly '/assets/audio/background-dance.mp3'.",
        "Mute/unmute and volume controls continue to work and persist across reloads using the existing localStorage mechanism.",
        "Default volume remains conservative (at or below the current 30%) when no stored preference exists.",
        "If autoplay is blocked by the browser, the UI clearly offers a “Play music” action and the rest of the page remains fully usable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Ensure the Audio instance continues to use the exact path '/assets/audio/background-dance.mp3'; preserve existing mute/volume persistence behavior; keep the default volume at 0.3 (or lower) when no stored preference exists; when autoplay fails, expose state so the UI can clearly offer “Play music” without blocking the rest of the UI."
        },
        {
          "path": "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx",
          "operation": "modify",
          "description": "Keep existing mute/unmute and volume UI (shadcn-ui Button/Popover/Slider) working with persisted preferences; ensure that when autoplay is blocked the Play music action remains visible and usable while the rest of the page stays interactive. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}