{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make Play button reliably start bundled background dance music with correct UI + error handling",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Make the floating Play button reliably start /assets/audio/background-dance.mp3 (looping) and immediately switch UI to mute/volume controls after successful start while preserving opt-in, unblock logic, and volume/mute persistence.",
      "acceptanceCriteria": [
        "On a first-time visit (no prior opt-in), the site does not autoplay music and shows the Play button.",
        "Clicking the Play button starts audio playback of /assets/audio/background-dance.mp3 (looping) and the UI switches to the mute/volume controls.",
        "After a page reload (with opt-in stored), music either plays automatically or, if blocked by browser policy, starts upon the next user interaction per the existing unblock logic.",
        "The existing mute/unmute and volume persistence behavior continues to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Harden userInitiatedPlay() so a click always attempts playback even if the audio element is not yet initialized (create/initialize the Audio instance on-demand using the unchanged path /assets/audio/background-dance.mp3), keep loop enabled, and synchronize isPlaying with audio events (e.g., playing/pause/ended) so the UI reflects the playing state immediately after a successful start while preserving existing opt-in + unblock-on-gesture behavior and volume/mute persistence."
        },
        {
          "path": "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx",
          "operation": "modify",
          "description": "Adjust controller rendering logic so the Play button-to-controls transition is driven by the hook’s reliable isPlaying state, ensuring the UI switches immediately after successful start; keep existing shadcn/ui Button/Popover/Slider usage (do not modify files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "When user-initiated playback fails, show a clear English error message while keeping the page usable and allowing Play retry.",
      "acceptanceCriteria": [
        "When userInitiatedPlay() fails, the UI shows an English message indicating music could not be started and suggests trying again.",
        "The Play button remains visible/usable so the user can retry starting music.",
        "No console error causes React rendering to break (page remains usable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Add a user-facing error state (e.g., string) to the hook that is set when playback fails due to blocked playback or load/play errors and cleared on successful play; ensure errors are caught and handled so no uncaught rejection breaks rendering, and keep existing behavior for opt-in, unblock listeners, mute/unmute, and volume persistence."
        },
        {
          "path": "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx",
          "operation": "modify",
          "description": "Render the hook’s error message in English near the floating Play button when not playing (without blocking the rest of the UI) and keep the Play button available for retry; ensure the error clears after a successful start. Keep existing shadcn/ui Button usage (do not modify files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}