{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Swap floating Play-button background music to “Binary Finary 1999” while keeping the same asset path",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Keep the Play-button background music flow unchanged while swapping the bundled track to “Binary Finary 1999”, continuing to reference the exact same audio path.",
      "acceptanceCriteria": [
        "Clicking the floating Play button starts playback of the updated track.",
        "The code continues to reference the exact same audio path: \"/assets/audio/background-dance.mp3\" (no path changes).",
        "Existing background music behavior remains intact: no autoplay on first visit unless previously opted-in, and the controller still switches from Play to mute/volume controls when playing.",
        "If the audio file cannot be loaded/played, the existing English error message behavior remains visible and the Play button remains available for retry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Add a code comment and a small in-file note to document that the background music track has been updated while the audio path string must remain exactly \"/assets/audio/background-dance.mp3\"; do not change any behavior, user-facing text, or the path literal."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Bundle the updated audio track at the existing static asset location \"/assets/audio/background-dance.mp3\" without adding any new playback paths/files.",
      "acceptanceCriteria": [
        "The built frontend includes the audio file at the same location that resolves for the browser as \"/assets/audio/background-dance.mp3\".",
        "No other code changes are required to select the new track (the existing Play button flow continues to work)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/audio/background-dance.mp3",
          "operation": "create",
          "description": "Add the updated bundled MP3 audio content for the requested track (“Binary Finary 1999”) at this exact static path so the browser resolves it as \"/assets/audio/background-dance.mp3\"; do not introduce any additional audio files or alternate paths for playback."
        }
      ]
    }
  ]
}