{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove floating background-music Play button UI",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Remove the floating background-music Play button and any related starting/loading UI so nothing is shown when music is not playing.",
      "acceptanceCriteria": [
        "When music is not playing, no floating Play button is visible anywhere on the page.",
        "The previous 'starting' / loading indicator tied to pressing Play is not shown (because Play is no longer available).",
        "The change is limited to UI behavior; it does not introduce any new user-facing text (all remaining user-facing text stays in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx",
          "operation": "modify",
          "description": "Remove the non-playing UI branch that renders the floating Play button, error toast, and the 'Starting music…' loading indicator; instead render nothing (null) when background music is not currently playing. Keep changes limited to UI behavior and do not add new user-facing text. Do not modify any files under frontend/src/components/ui and do not change the audio asset path used elsewhere (must remain exactly \"/assets/audio/background-dance.mp3\")."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Ensure mute and volume controls render and work only while background music is already playing, with no UI rendered otherwise and no new way to start playback.",
      "acceptanceCriteria": [
        "If background music is playing (e.g., user previously opted in and autoplay succeeds), the mute and volume controls still render and work.",
        "If background music is not playing, the background-music controller renders nothing (no error toast UI, no buttons)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BackgroundMusic/BackgroundMusicController.tsx",
          "operation": "modify",
          "description": "Gate the controller UI strictly on isPlaying: render the existing mute and volume controls only when isPlaying is true, and render nothing for all non-playing states (including blocked/errored/starting). Ensure no remaining UI triggers exist for starting playback."
        }
      ]
    }
  ]
}